






const graph0 = `

{"connectiăs":Ā1Č[ĀidČ0,āăąćĉnTypeČāhaĄel"}]ė2ĐĒĔ:ĖĘĦěăĞĠĢcĤĦĨĪ}ėnodeċ:đ"ēĕėtğġ:"gain"ŋitlŎŐŒŔėxĕ.5623529411764706ėyŠť12Ů600Ŭ77543ėaudĉParamValuńČĀőœŠ48ŰŭŰ25źƝ04}ĿįČ1ŋōĢoscillatorŕ"ĈŘŚƩƫƭƯƱƳşı.68373879ŭ1ƖŦ8ŲŠ6103ŭǁ33013ƀ5ƂƄĉNłŎĀMONOČ6ǩ42Ĳćƾ{Ŀ"kbMǡĢpolųėĂĴteƐņǰī"sourcȁĀƖƑňsOŔ:fƍseǱ49ȎiȐȒȔlȖǱƜțȝČȟȡė5ďčȏȑȦȕȗȩĭčȢ3ȤȮȓȰȢ4ȷȞȺȩ5ƑȢ6ɂȩ7Ʌ"6ɁȴėǩɈ6ɇɌɉ8ɏȚɒůɈ7ȫǰė7ȳɜ"ǄəȼɗɋɠŬəɑɧɔɗɖɠƗɈ8ɛǱ8ɟɴȶɒ8ɤɯɦɴɄɹɪɴɬɯɮǱ90Ɉ18ɿɠʊʁėʊʃǱʊʅʐʇʉ9ɳĬ1ʕ"22ʚʞʟɂǱADSRŅȌʃ"rħeaȖIİ-1ȘɮʭʯʱeʳČʵȢʈȬʮřʻʽ:ʿȩɛʹ˄ʲʴʶȲȎ˃ʰˍʾˏ"5ɸĀ˒˅ˎȻˑʺ˔ˇ˖5ɦˋ˓ʼ˝ȩʌ˦˜˕Ȣɪˬˡˈɉ˥˛˲˖Ɏ˂ˠ˨ˮɍ˰˶˼ˢǱǁ˟ˌ́˳6ʸ̀ˆ˳ɘ˺̆̌˖ɚ̅˧̑Ǳɞ̔˭̂ɝ˙˱̇̒ɻ̞̖ɝ˵˻̣ɡ˫̋˩ɡ˿̦̫7ʬ̪˽ɡ̮̳̊ɰ̫̏̕ɲ̙˷ɴɟ̢̛̻̝̲"ɺ̟̽ɴ̶̥̻̩̐ͅǆ̧͈8̱͏˳8̵̳͌ʗ̹̚˳ʊ͎͚ͅʎ̫͒ʑ̳ͥʔͨͣ͜˚͖˖ʜˊ̈́˳ʠ͙̺̳ʟͲͯǱʟ̀ͳʶǱƮstǵŁKeyPʮsȖˎė_ŌĸŏtriĥgřƳŃtuąȎsȉʤėfʮqƏncųȬΠcʤǱƃƅoǠŃķŚΔΖnΘġǝαƇƉƋƍƏʪ"ΤeΦeΨΪŪĲΛΝŎ1ǀƖƀžơ,ƣ:2ƦΒ"buffeƲŖƶĢϝϟϡƽƕ3ʙƗ˘Žɞ0ǆƟǎƿǐƗǫʟŭǆŦϫμǟǶȬǤǦǨǪǬǼtǯǱǳǵŃǷǹǻĳĚǿȁđĪėȆȈȊσȍɒșɈȣɒȪПɶȩ˙˞Сɽ˪Пʏ˴ɏʌ̃Ь̄ɒ̉əˁɧʡ̘ɗЦɝɻ̗Щ̨ɩəʒɝʝ̸ɯʡɵɱл͆нė8пʋɱЬ͔ɱʝͭʓёɒͤњєќʝʜжʓʙɈ͵ѤʠѦɶʥʧʩȎМͮ͢˳О̾͝ȩж̳́Тѳ͉ːѺ̧˘ͫ˳ſҀˣ͋ͷͅŢ҃˯҉ɍ҅͞˸̭҆̈͡Ѱ˸͕Ҕ̃ͶҎ̗ѶͿ̗ͺҗɝ;ͻ̜ҋɡ̡ҝ̤ҥɨѽ̯ғґ̒Җү̗ҙѴ͆Ҝң͆ҟҲюҢҠ͆̓Ҹ͇Ҭ̷ҍҵљѯһ͆ҮҚюұӌ͆Ҵѻ"ͭѷͣӇӕ͑͟ӃӖӎҵͪӛ͟ӔҨ"ͱҥѥӠ˖͹ӦʣӨϕ"΂΄ăo·Ή΋΍˕ėloopČΔƏėϦϠrInŃƾόeΜΞΫΡȴǱpƮybackRƯǢȅԎǰӮΰƆƈƊƌƎȋ"ԑaԓԕԗԙŠŤŢťėύԌ0ơ]}

`.split('\n').join('')




const graph1 = `

{"connectiăs":Ā0Č[],"1ĐĀidČ3ēĂĄĆĈăTypeČāhaĞl"}Ē"2Ė"ĘĚĜăąćĉnĢĤĦcĨĪĬĮ3ıĳ:6ĵĞĸġģĥ:ħĩąīĭē4ńę:1ňķĠĺŌĦfrequencyĬ,ėŗěāĶğĹĻō"ŠŢŤŦŨœ"5ŖČ4ŚŰŋļŎľŐeŒŪĲŗŇŮŉŜŲĦpĩŁē6Ž:0ƀŊŝƃŏŀĭ}ēnodeċ:[ūČƙ"tŞŎgain"ēĈtlųƱƳƵ"xƫ.52ēŨƘ.719539347408829ǃ"audĉNƤō{ơǘǚĉParamValŤƧĀƻƴǆ6ǌ0625}ơƪŘƶƯ"oscillatorƽƷƹĦȀȂȄȆȈƽƿǆ3ƌǅ0.2ǌ8464491Ȗ27ǳ7ēǙǛoǝƥČĀMONOČ6ȶ42ƬćȔǠēkbMǞĦƣąƽĝśeƦĖźsourcɊč"ȶȟȹȯǹēADSRǮɔȷɗɓšƹaseIŗ-1ə"ȅstɁƣKeyPšsɧɪř"_ƮƝtriĩgȌēƥtuɅɓsɐɘǡŵţťŧȯ"ʍcʏǡȪǜǞƐŎʁʃnʅĥȩǣoǥǧǩǫǭʕʑŷʔ:ǑƬʈʊō1.ȟȝ37ǸǺƊČǗɿųbuffeȉƶiƸ˃˅ˇˉƾǀǂǄǀǏ96ǖ89ǔ7Ƿǂǐʥȫȭǟ"ȱȳȵɡȺtȼǡȿɁȮŎɄʤƍɈɒƩɌɎɐɒĀɕȸďɓisOǱʁŤɭɛɝɟ˽ɢĀɤeɦɨɻɭɯɱăoɴɶɸɺČɫēloopČ̅eē˄ˆˈInƥȔʳeʉʋĀʗʏēpȅybackRȆˤ̳čǹʚʦʨǨǪǬ˻"̶a̸̺̼̾ǀȥ265431701ȶ͚ƌʴʋ0əǻŭ˂şȃtˈȊˋȌŎfͧͩḙ̄.Ȗ˔ǆ˖˘2˚˜˞ȥſǢˢɂ́ˡʜƥʞɮowƒɹƽʛʧǦ͆ʫ͉ʮʓǅ605.04͛8Ƕ˗ȞŭQČɼǰ˒ʇ̯ʵƫ͢ʿʱǽƝΥˊˌĦΰˑǆǉ9θικκ8͵șͷ˙˛͒5˟;΍ˣɘ΃Ύʩ͇ʬɓΥ:30͡ʾŅ5ήųȎȃȅȇːȋϙȁϛȑːͲηλϧθν"ȘǇǉǋǍǏǑǓǕǗχ΁ȰȲȴņ˩Ĝ˫ω"ˮ΁"˲ɆůćɉƧ˷Ū˸ɏɑ̊˩̴"̈ɞʕ̋˿̍Ƈ̏ɧɩ̜ɬǡ̔ɲ̗ɵɷƦ̛:̝ɽͥŎsƳ˳̿͟ʎ́ʐšʒŸʕ̀Ǡɭ϶΅ǾЬɅϊͅʪ͈ɟΓж:2ǁ9ǒ͙1Λ˛ϒ32ǗЯΪϕƋϘƑƆϞͫųƒĞϤǀʹϫǀǈǊǌǎǐǒǔǖϊψ΂ͿǤΏтώĀўѕ]}

`.split('\n').join('')




G.fromString(graph0)

GraphController.renderer.render()