






const graph0 = `

{"connectiăs":Ā1Č[ĀidČ0,āăąćĉnTypeČāhaĄel"}]ė2ĐĒĔ:ĖĘĦěăĞĠĢcĤĦĨĪ}ėnodeċ:đ"ēĕėtğġ:"gain"ŋitlŎŐŒŔėxĕ.5623529411764706ėyŠť12Ů600Ŭ77543ėaudĉParamValuńČĀőœŠ48ŰŭŰ25źƝ04}ĿįČ1ŋōĢoscillatorŕ"ĈŘŚƩƫƭƯƱƳşı.68373879ŭ1ƖŦ8ŲŠ6103ŭǁ33013ƀ5ƂƄĉNłŎĀMONOČ6ǩ42Ĳćƾ{Ŀ"kbMǡĢpolųėĂĴteƐņǰī"sourcȁĀƖƑňsOŔ:fƍseǱ49ȎiȐȒȔlȖǱƜțȝČȟȡė5ďčȏȑȦȕȗȩĭčȢ3ȤȮȓȰȢ4ȷȞȺȩ5ƑȢ6ɂȩ7Ʌ"6ɁȴėǩɈ6ɇɌɉ8ɏȚɒůɈ7ȫǰė7ȳɜ"ǄəȼɗɋɠŬəɑɧɔɗɖɠƗɈ8ɛǱ8ɟɴȶɒ8ɤɯɦɴɄɹɪɴɬɯɮǱ90Ɉ18ɿɠʊʁėʊʃǱʊʅʐʇʉ9ɳĬ1ʕ"22ʚʞʟɂǱADSRŅȌʃ"rħeaȖIİ-1ȘɮʭʯʱeʳČʵȢʈȬʮřʻʽ:ʿȩɛʹ˄ʲʴʶȲȎ˃ʰˍʾˏ"5ɸĀ˒˅ˎȻˑʺ˔ˇ˖5ɦˋ˓ʼ˝ȩʌ˦˜˕Ȣɪˬˡˈɉ˥˛˲˖Ɏ˂ˠ˨ˮɍ˰˶˼ˢǱǁ˟ˌ́˳6ʸ̀ˆ˳ɘ˺̆̌˖ɚ̅˧̑Ǳɞ̔˭̂ɝ˙˱̇̒ɻ̞̖ɝ˵˻̣ɡ˫̋˩ɡ˿̦̫7ʬ̪˽ɡ̮̳̊ɰ̫̏̕ɲ̙˷ɴɟ̢̛̻̝̲"ɺ̟̽ɴ̶̥̻̩̐ͅǆ̧͈8̱͏˳8̵̳͌ʗ̹̚˳ʊ͎͚ͅʎ̫͒ʑ̳ͥʔͨͣ͜˚͖˖ʜˊ̈́˳ʠ͙̺̳ʟͲͯǱʟ̀ͳʶǱƮstǵŁKeyPʮsȖˎė_ŌĸŏtriĥgřƳŃtuąȎsȉʤėfʮqƏncųȬΠcʤǱƃƅoǠŃķŚΔΖnΘġǝαƇƉƋƍƏʪ"ΤeΦeΨΪŪĲΛΝŎ1ǀƖƀžơ,ƣ:2ƦΒ"buffeƲŖƶĢϝϟϡƽƕ3ʙƗ˘Žɞ0ǆƟǎƿǐƗǫʟŭǆŦϫμǟǶȬǤǦǨǪǬǼtǯǱǳǵŃǷǹǻĳĚǿȁđĪėȆȈȊσȍɒșɈȣɒȪПɶȩ˙˞Сɽ˪Пʏ˴ɏʌ̃Ь̄ɒ̉əˁɧʡ̘ɗЦɝɻ̗Щ̨ɩəʒɝʝ̸ɯʡɵɱл͆нė8пʋɱЬ͔ɱʝͭʓёɒͤњєќʝʜжʓʙɈ͵ѤʠѦɶʥʧʩȎМͮ͢˳О̾͝ȩж̳́Тѳ͉ːѺ̧˘ͫ˳ſҀˣ͋ͷͅŢ҃˯҉ɍ҅͞˸̭҆̈͡Ѱ˸͕Ҕ̃ͶҎ̗ѶͿ̗ͺҗɝ;ͻ̜ҋɡ̡ҝ̤ҥɨѽ̯ғґ̒Җү̗ҙѴ͆Ҝң͆ҟҲюҢҠ͆̓Ҹ͇Ҭ̷ҍҵљѯһ͆ҮҚюұӌ͆Ҵѻ"ͭѷͣӇӕ͑͟ӃӖӎҵͪӛ͟ӔҨ"ͱҥѥӠ˖͹ӦʣӨϕ"΂΄ăo·Ή΋΍˕ėloopČΔƏėϦϠrInŃƾόeΜΞΫΡȴǱpƮybackRƯǢȅԎǰӮΰƆƈƊƌƎȋ"ԑaԓԕԗԙŠŤŢťėύԌ0ơ]}

`.split('\n').join('')




const graph1 = `

{"connectiăs":Ā0Č[],"1ĐĀidČ3ēĂĄĆĈăTypeČāhaĞl"}Ē"2Ė"ĘĚĜăąćĉnĢĤĦcĨĪĬĮ3ıĳ:6ĵĞĸġģĥ:ħĩąīĭē4ńę:1ňķĠĺŌĦfrequencyĬ,ėŗěāĶğĹĻō"ŠŢŤŦŨœ"5ŖČ4ŚŰŋļŎľŐeŒŪĲŗŇŮŉŜŲĦpĩŁē6Ž:0ƀŊŝƃŏŀĭ}ēnodeċ:[ūČƙ"tŞŎgain"ēĈtlųƱƳƵ"xƫ.52ēŨƘ.719539347408829ǃ"audĉNƤō{ơǘǚĉParamValŤƧĀƻƴǆ6ǌ0625}ơƪŘƶƯ"oscillatorƽƷƹĦȀȂȄȆȈƽƿǆ3ƌǅ0.2ǌ8464491Ȗ27ǳ7ēǙǛoǝƥČĀMONOČ6ȶ42ƬćȔǠēkbMǞĦƣąƽĝśeƦĖźsourcɊč"ȶȟȹȯǹēADSRǮɔȷɗɓšƹaseIŗ-1ə"ȅstɁƣKeyPšsɧɪř"_ƮƝtriĩgȌēƥtuɅɓsɐɘǡŵţťŧȯ"ʍcʏǡȪǜǞƐŎʁʃnʅĥȩǣoǥǧǩǫǭʕʑŷʔ:ǑƬʈʊō1.ȟȝ37ǸǺƊČǗɿųbuffeȉƶiƸ˃˅ˇˉƾǀǂǄǀǏ96ǖ89ǔ7Ƿǂǐʥȫȭǟ"ȱȳȵɡȺtȼǡȿɁȮŎɄʤƍɈɒƩɌɎɐɒĀɕȸďɓisOǱʁŤɭɛɝɟ˽ɢĀɤeɦɨɻɭɯɱăoɴɶɸɺČɫēloopČ̅eē˄ˆˈInƥȔʳeʉʋĀʗʏēpȅybackRȆˤ̳čǹʚʦʨǨǪǬ˻"̶a̸̺̼̾ǀȥ265431701ȶ͚ƌʴʋ0əǻŭ˂şȃtˈȊˋȌŎfͧͩḙ̄.Ȗ˔ǆ˖˘2˚˜˞ȥſǢˢɂ́ˡʜƥʞɮowƒɹƽʛʧǦ͆ʫ͉ʮʓǅ605.04͛8Ƕ˗ȞŭQČɼǰ˒ʇ̯ʵƫ͢ʿʱǽƝΥˊˌĦΰˑǆǉ9θικκ8͵șͷ˙˛͒5˟;΍ˣɘ΃Ύʩ͇ʬɓΥ:30͡ʾŅ5ήųȎȃȅȇːȋϙȁϛȑːͲηλϧθν"ȘǇǉǋǍǏǑǓǕǗχ΁ȰȲȴņ˩Ĝ˫ω"ˮ΁"˲ɆůćɉƧ˷Ū˸ɏɑ̊˩̴"̈ɞʕ̋˿̍Ƈ̏ɧɩ̜ɬǡ̔ɲ̗ɵɷƦ̛:̝ɽͥŎsƳ˳̿͟ʎ́ʐšʒŸʕ̀Ǡɭ϶΅ǾЬɅϊͅʪ͈ɟΓж:2ǁ9ǒ͙1Λ˛ϒ32ǗЯΪϕƋϘƑƆϞͫųƒĞϤǀʹϫǀǈǊǌǎǐǒǔǖϊψ΂ͿǤΏтώĀўѕ]}

`.split('\n').join('')




// const graph2 = `

// {"connectiăs":Ā8Č[ĀidČ0,āăąćĉnTypeČāhaĄel"}]ė9ĐĒĔ:ĖĘĦěăĞĠĢcĤĦĨĪė10Į"ēĕėĂĴĈĶğġ:ģĥąĽī"11łńıņęĆŉĝŋĹĻŐĩŒ12Đ]}ėnodeċ:đŃİĲtŞōgain"ėĈtlŌ"ŷŹŻ"xĕ.16876064403ŀ8995ėyƇ47924256ŀƌ29ŀ4ėaudĉNūŌ{Ũ"ƫƭoParamValuŭČĀƂźı.48ƎƏƎơ0ǎǏ4}ŨįČ8żŵ"oscillatorƄŽſĢǚǜǞǠǢƄƆǆ3ƖǱǲǳ97ƙƛ5522ƌ867ƒ096ƘƴƬƮưǂ"MONOČ6ȑƠĲćǮƲėkbMȉōpolƚřňeǁůƲŒsourcȥĀǈǂƳ4ĭčƳ5Łȵė5ŕȹ"ǺȱȺ3ɀȾ4ɃǹɆ6Ɇ7ɃȄɌɉȽǿɌďɐȴȗ"ȀɃ7ȼɖ7ťȽ7ɂɟɅɟ5əɏɜɋɟɓɜɕƳǉɃ8ɛɮɞɖ8ɡɵɣɵɥȽǾɰɩɵɫɮɭĬȸɖ1ɽȽʇɿƳʇʁĿƕɃ19ʅʌƧɃ2ʒʗʘʚɴǒėADSRŮȯɫ"rħeaseIİ-1ȲɕʧʩʫʭʯʱȺʅʴſʶʮČʰȶɛʼʪʬʿ:ˁȺɴ˄ʾʸȶɷˌˆˎȺɹˑʷˀʹȾɻĀʨʽ˒˘ȶɧ˖ˇˉȾɿˣ˓"ɍč˨ˠėȑȊ˝˅˗ˈ˙ɑˬ˲ˍˮ˪ʦ˹˟˵Ƴ6ʳ˾˴˥ɘ˸ʵ˿̆˃̄ˤ˙ɝ˱̉̅̏ː̍˩7˕̖˻7˛˭̀ėƌ̑˞̓Ƴ7˧̟̚ɗ˽̥̬̒̎̃˩ɯ̣̭̈ėɱ̢˳̵"8ˋ̨˥ɶ̸˺̩8̙̰˻8̝̾˙ʈ˜̴̧͎̫̱̯͔͆̓̿˻ʓ́̊˙ʇˢ͊ʌƋ͚̤ʏ͓̹˩ʇ͖ͦ˻ʒʻ͟Ŀʖ̳̩ͪʘͩ͂˥ǻ̌͑˙ǻ̽ͺʞ"_ŴĸōsŹġėŬtuąȊsȬȱƳfʨqǀncƚˬΎcΐƳƵȈŬķƀ΅ΌƪȇƷƹƻƽƿȮ"ΒeΔeΖΘŔ1ΈeΊΌıʞǔ:9Ǘ΃ǙǛǝǟǡǣżižƀǨσǫφƅƇǰǴϒǵǷǆƊ2̈́153ǎ54ƏǈΥƶƯŬȊȌȎȐȒ2ȔtȖƳșțϥȝȟȡĳĚtȤŮđľ"ȩȫȭʤ"ȰȽȳɆʔȺɲˊɆɷȶɹȶ˛ˡɊɌА˯ɧ́ʋ˯ʎ˪ʃɗЇɗЉɗʝ̠Ќ̠Ў̠ДɗЖ̠И̪əМ̲ɵР̼ɰФ̻Ц̻Ш͌ɮЬ8КʐȽ͙ʉкʏЬʍʑпʆсщРʹʚьǻΐʟʡʣȊЃ͍̩͗ЅͱͶ˙ȷ̺͢Ȼџ˩ȿћ͛ˏѢ˻ϞѨ̩ɇѥͣȾ͞;Ⱥ͐ј˥˫їͲѶѱѵ˶Ѵѹ˶ͥќ́͵Ѧ̠ͭѲПѫ̆ͽѼ̥̕҈̘Ҋ͉̏Ґѻѿ̥Ѿ҂̠ҁ҅ɗ҄ѯа̞̿͹ҍ̶Ҍҗ̶ҏҥжҒɮҔҫ͌Ң͋ҙҝнҭ̶ҟ̺ъҲ͠ҖҚœ͡Ѯ̺цӂͧшҼͯ҇ҫʒҤҨ"эӅ˻͸ҷӏѐӑ̀Ƴ΁ǘΣ·"Ή΋ƱϽΏȵΑΓΕΗ΍ӣƲͿΞoϤeΡĢӜƄӭƸƺƼƾǀЁήΰβČŔ3ζθŌ0λűӿųǘϋǪυǤψǦōԋτǬėǮ0.ϑϓǳǶ"Θԗ341ȓƌȷǼ3ǻƩȆϣȜĀϧȏ:ȑƏϫņϭɃϰȜ"ȞȠƄŇϷϹĮϼϾȬάіʲІɆРѤɖϛɆзѭՋЪ˦ГɎɌЬƊɌМ̇ɜР̐ɟеґɤɦəЬ7КƝɰО̷ɼТ̻ё́ɰйՑӁʀɰМъҽчхҶтМͬʑͰɖӐցʛȽͼё"ʠʢЁіӈЂҹѣӊӎѡӗ˥Պ֍Ռ֔ѝͅҫՏ֗Ҿҝ5Ҵѯѷ֍˰֙ЗӔ՗֧˯֏̛֑ҿɚӔ՝ѸְҪӎՠִҝֲ̜֟ѯֲ̦Ҝ־֭̓֯ҵӍҿг֫խӔկ׊͈׌ֽ̺ճ֍ջֹҠ׃˥һͮӀבӆ֢Ӄו֍ͨӔվ׊ӌӔւ֍ӓ׊ֆ֧ә΂΢ΆƄӟιĀΚևӼӧΘ׶ӪǒΝΦӯӱ΄ײϢĉӶΩӹά׹αӨ:ŔĲ״ԄԆŗŔοϊςԌԔ"ǥؗǩԓώԖԘԚǴԜԞ.ƢʓԠƍɶեƋ0ԜӭӯϦȍԯԱȓԴϮȘȚԸԺϵԽśԿȦՁȪՃ֋КњՋО֓Ջլ֘ՋՎШƢВɐШ֦ɖ˷ٗК̂əОֱɟլɠəзֻɟՑֿɪЮըɰвլ̀ɼз׏ɼղмоնО͝չчКףʉշͯьʙօքփʝƳ։єˬ֌כوׅ֗ѯً֗ҧҿَ֛֗֒ү֒םѩן˩֤כٖ֥ڜ˻֪ז̺ٛ׊՚֍ٞڥ̗ڒְֶֺږְژְښ̩٧ڬׁ̛̺է׎ڎגׇҵڮҠڰҵڲҵڴҵڶ̿ڢ̓ڻ͕Ӕך҈ٸצדכӄڹ̩ټۙ˥ץۜ͜րתځ۟Ƴ׫ۤė׭ۤׯӛ؄ӞηӠөΛӤė؋ӾΙ׽Ӭ؀ư؂ϽۭӵΨӸΫӻӦ،γŤԂ۰κǓԇ؎2ؖǧؘ؟Ԏωܐ؞ύǭϐأԛϕԗƧ04ǹ3ɠƑƣ9ԁԪΟӡԮϩԲϬع"ԷϲԹϴԼŚćف[ȨلЀѕهМўȽًȶٍеѪّ݁Ց֡ՓɐՑ٘́ٚՙٝ՜٠՟٣Ш̡ɟդզЯթ٬дɰٰձɾɰٵɃپלٹтٻшʕٷրۥۣۥڃݲڅђ֊ܽӔڌכ݀ۧȾہڏۃѠۅڏۇڏۉڏۋѝۍѶއڦމ֨׊ڤ֥ט̏ڿ̗ݿڼށ̗ރڼޅڼލ̗ޏЫ׀ֲޔɮޖ͇ޘ̱ޚ͇ޜ̱ޞ̱ޠ͇ޢ̻ދ͋ۏ͇ަʄפұۗۖۓס޾޺œےӋۡכש߈ڃתӖ۪ėӚπӳ܈׵Ӣ۲ӫ۴܄۶׼ߖ׾؅Ӯۻ۬ΤܨΧӷΪӺȊ۵؍Ŕԩؑĕǒŧ

// `.split('\n').join('')




G.fromString(graph0)

GraphController.renderer.render()