console.log('app.js is here')


// {"0":[Āidă5,"connectiĎTypeăČhaďel"}]ċ1ăą"ćă3ċčĞĒĔnĖĘĚfrequencyġģ"2ĦĆĈ:īČĎĐįĕėę:ěĝĐĠĢċ3łĨń4ĬňđēŋĳŎcĜĞŒĿ4Ŗĩ:0ŚĮŝıŌĚšŐğľċ5ŧŘūŉŭĲōŏţŴ"6ŷă7ŹŜİżŰŢőġ,ŃăŪŇŬƈůŠƋųœ"7ƃ:2ƆŊŮş"ĵķĹĻĽƙ8Ɯ1ƟŻƕžƌ}ƎŗăřƒźƔƢpĝƍƏ:9ƭƹŽűſƙ9Ɯ6ǁŞŽplaybackRatęĢ}:ǛħŨƑtƯgain"ċxƐ.4891165172855313Ċ"Ľũ.12Ǹ52709Ǻ9605ǭċaudĔParamValĹsăĀǢǤǩ5}ƲƾƬ"ǠƢȟǥǧǩ29ȅǶȋ7618437ǀǼȡ073Ǭǯ25ȴ5ȳƶȏȑoȓȕȗșțȝ"Ȫă100ȣƳŨƞȧƯoscilǎtorǦ"ǨǾ1ȷ4ȋ8Ǭɮ4ȳǸņǽ0Ǫ7783ɂȀȂȄȆǉ"ɈĔNodeƉŎsǤęȎȐȒȔȖȘȚeȜ:ĀƤĸĺļă9.ȹ2ǲ64ʣȆ08ǰċʇtuĐƐɗƾņȨŽfɠǗɥȬǾ2419ȯȷǭ8ȋȸȳċɵ.69ʡȵ226ȊȆǵɚʃoʅʇʉ"lowƻsȜʎɉɋʒɎʕɐʙƦʜ:4ɬċQɓċɒǾǻʫʭōɖȤƴ˪ċʳĚƻĞʸɧȡɃȯ8ȁ3034ɅǮˆǩ6206ǬǰǱǳʼȿˠʐɌʓɏʗ"˾ʯ˸Ũǻ˼ŎʇǎĽʹɶǰ8ǹ̑0ǲˊɅȸ̍ʺȿǭ̏Ƀ1Ʌ6Ǻǫ̙ɊʑɍʔʖĀ̧ǏTim˶ǿȾ0ˍʰ˹ʁ̥"sȖǍèɨɶȄȃɮȆʡǬ5ɕʁˇȵȉǶǲʻǹȹǸ̀˖ōĀĭźe˥Ą{Ȥƙbuff͙Inʇ͛ċ˚opătrĹċǍǏǑǓǕǗɐvˤ˯ƷŜɤʖąǙʪeʬʮ̞ΔʔƐƭΙĦ]ƲČtɨ͸ċsourcͶΛƎ͹ζθέκηλιμοξρνσπτςοΨͯʆʈƯ΅·̀ˢ̝̓Ā΍ǐǒk͉͋Ζ˴ΠƑϕΏǔǖō1͑Ũƅɛȩǣȫ́ɩɬȶͣȅ4ˍǷȃɚˇȁ̻ɿȇȌȊȌȦ˔ϑ̜ͶȞϪĉɕϥń8˻ɜɞɠɢɤɦ͛Ǫ̽ͣɺˍˏɻϵͥǩ˫3̉ȯǷˉ̭̊ņ˔Ͱ˘ʋʮϐ͂ЂͅƣĶʚƧƵΝΟ˶ЈʝЋϩȠ̪.ȸȿȹʣɪ˒7Ƿ̵ɶЙɽϹȅϻȉЫ̛ˤЮ˱ɶ͏ͣɕіїіϤĢ

// {"1":[Āidă3,"connectiĎTypeăČhaďel"}]ċ2ăą"ćă0ċčĞĒĔnĖĘĚcĜĞĠĢċ3ĦĆĈ:īČĎĐįĕėę:ěĝĐĸģ"4ļĨľ2ĬłđēŅĳňplaybackRatę},Ľă1ŔĮŗıņĚśŝşšţťġō5Őĩ:4ŬŃŮĲŇŉķŸ}:ƈħżŀtŰňgain"ċxĪ.5ċyƗ12ƙ"audĔParamValuesăĀƐƒƗ5}ŧũ:ū"ƍř"sƨśerƔ"ƖĿ.4335937ƟƛǇ496760ƞ91792656žƠƢĔNodŇĀĭƀeƮļĹ"buffǂInǨǆƺloopăfƫseċǨtuĐư"vƫƭĪċnƨƃȆȈęſŖorƯĄ]ŧ"ŲŞŠŢŤǩȋȍŇƺȑmƃȠŴȣŷȗĒșțąĢȞƼƃǼǾǄĒǆ{ȞȔĐSrcưȞȭȢŶeɃɅ:ȿċsouɄǮĄɏɗƷəŨɚɘɛɞɝɠɜɢɟɣɡɤɧɦɘȝċơƣoǦǨƂĚȺǿɬǤoƥƧƩȧțĀɈŵȤŪȅeȇȉĿƶŨőăœƻƎƾǀlǂǄǆ0Ƙ48ǉǏƚƴǊ477321814ƞǓɶɮɰȥǫŖǭȴȿōǲǴǶǸeʔċɴȀȂȄ"ɁȥȌƬŇŀȪȓʄȕȼŕȲȚĦɫȟŜȡʀŷɎȦ˂ʂ"˅űːȮɊˉŭȳǯˎȸɳǽɵČtȾɀˇɂɄɆċɿȯɋ˭ɎȞɑɓcɕȵɨɥ˼˻˾ɩ˽̀˿́əˎɭǥǧeɲňʺʩƤƦƨƪ˂ɽˏųɉʁƹʃʅ˃ʈƸĊʍƽƲƓƕƗ4ʞǟ6ƞʛǇ2850971ǝ224̩20Ǣ̇ɸ̐ɻ̓Ȋ̢Ī̝ʊŽċˣƏƑ̣ǅ̥7ʤ̪"Ǒʕǟ̦2ǖ45͎8Ǌ69̎̽ɺ̒ƭ̔͂:2.8̭ͩƝ̯0ͮͯ4̈́żƟ͈"oscilŜtșʓƗǎ03̫͓ͬ6306͝5̷ǉ̩̮͟ʫ̋ƾƒȖǣɮɹ̑ɼȊfreqƭncǑ̦ŀʿ̓Ģ


G.fromString(`

{"1":[Āidă0,"connectiĎTypeăČhaďel"}]ċ2ăą"ćĉċčĞĒĔnĖĘĚcĜĞĠĢċ4ĦĆĈ:2īĎĐĮĕėę:"playbackRatęĸ"5ĻĨĽ6ŀĭēńĲŇĴĝĐķ,ļă4ŜłŞİŅĳĵŤġģ"6Řĩ:ũČŁđŬıņěţğġŦřă1ŪżįžĚŉŋōŏőœŲċ7ŶŚƈŃŭŠƀĶŲ}:ƠħŷĊ"tŮŇgain"ċxĉ.5ċyư12Ʋ"audĔParamValuesăĀƩƫư5}}ƄŷƇƥƧ"sǁŉerƭ"Ư:0.454687Ƹƴǟ.39740820734ǵƶ53ċƺƼoNodņĀĬūeǇĻŕbuffǚInȁǞƤloopăfǄseċȁtuĐǉ"vǄǆĪ"nǁſȞȠęƘtorǈĄ]ǐňŊŌŎŐŒȂȣȥņǓȩmſƍȹƐȼǜȄżȱȳąĢȶƦƛȔȖɉtǞ{ȶȬĐSrcǉȶɅƏȻœɜɞ:ɘċsouɝȇĄɨɰǐɱŦɲɵɴɷɳɹɶɺɸɻɾɽʀɼʂɏǻƻĔǿȁƋŇɓȗʅǽƾǀǂȿȳĀɡȺƑɀȝeȟȡǟǏǑĽĿǔƛǗmǙǛƮǍǹ906ƷƳưǬ5248380ƶ9589śƹʆǾȀȽɊĒȆɍɘųȊȌȎȐeȒċʌȘȚȜ"ɚȽȤǅņƤɂȫʛȭɉŻĒɌĦȵċʖɇƒɧȾ˚Ɔċ˝ƌȸɢʘˡŝˤɯʄʣſ˒īɖɟʚʜeɥ˿ȷƎʗȼ̃ɧȶɪɬcɮɎʁɿʃ̖̘̑̔̓̒̕ɵ˦ˀǽʈeʊ"˼̝ƽƿǁǃ˚ʔ̅Ɇɣʙ˖˟ʝ0ʟŧ:Ǻ˺ĚǋƬʩǪ3265ʮǨưƷʵ5ʾ1ƶ3͈ʹƸǼ̥ʑ̨ǆ̪̹Ǎ̳ƅŸċɑſ͔̻Ǡ35ǳ8ǸʰǪ617710ʼ͊ǹǵͨʎ͏̧ʓȢ͔ľ.8͹2͢Ʒ0;Ϳ04͖ŷƸ͚ĚoscilŊȰʨǝ̓ʭʯ"ǩǠ63ʭ6ʻǤǶʮ85Ǔ͎˂ʉǕsquƿȮ̤oʐͳ̩ȢfreΧencǩǓ˗ĉ΃Ɨ̷ƨƪ̺ΐ̼1ʵǶǧͤǠǤ2ǲΘ23ǧʸ99͟ͱά̦ʒί˫ͶǠͧ8μă7͙ǕΈΊΌŒȱǜȒ.ϋǵϏ͂Ǫ4276Ǣ7͹33Κϸʭϕ̡̟ΦΨβǜ΢έϘ͒ΰβδζǩ̶κʞɲ͗ƶϢƛϤ΋΍Ϩ͝.΁60ϓχΔưͦϸʬ9ͻ7Ʒ7ʹ9Ͻ˃ϿƫΪЄϗ͑ɮĀαγǆЋŨʮ.Ηϓʷ̾ʸ4ͨϡ̯́λĢ

`.split('\n').join(''))
