console.log('app.js is here')

G.fromString(`

{"0":[Āidă5,"connectiĎTypeăČhaďel"}]ċ1ăą"ćă3ċčĞĒĔnĖĘĚfrequencyġģ"2ĦĆĈ:īČĎĐįĕėę:ěĝĐĠĢċ3łĨń4ĬňđēŋĳŎcĜĞŒĿ4Ŗĩ:0ŚĮŝıŌĚšŐğľċ5ŧŘūŉŭĲōŏţŴ"6ŷă7ŹŜİżŰŢőġ,ŃăŪŇŬƈůŠƋųœ"7ƃ:2ƆŊŮş"ĵķĹĻĽƙ8Ɯ1ƟŻƕžƌ}ƎŗăřƒźƔƢpĝƍƏ:9ƭƹŽűſƙ9Ɯ6ǁŞŽplaybackRatęĢ}:ǛħŨƑtƯgain"ċxƐ.4891165172855313Ċ"Ľũ.12Ǹ52709Ǻ9605ǭċaudĔParamValĹsăĀǢǤǩ5}ƲƾƬ"ǠƢȟǥǧǩ29ȅǶȋ7618437ǀǼȡ073Ǭǯ25ȴ5ȳƶȏȑoȓȕȗșțȝ"Ȫă100ȣƳŨƞȧƯoscilǎtorǦ"ǨǾ1ȷ4ȋ8Ǭɮ4ȳǸņǽ0Ǫ7783ɂȀȂȄȆǉ"ɈĔNodeƉŎsǤęȎȐȒȔȖȘȚeȜ:ĀƤĸĺļă9.ȹ2ǲ64ʣȆ08ǰċʇtuĐƐɗƾņȨŽfɠǗɥȬǾ2419ȯȷǭ8ȋȸȳċɵ.69ʡȵ226ȊȆǵɚʃoʅʇʉ"lowƻsȜʎɉɋʒɎʕɐʙƦʜ:4ɬċQɓċɒǾǻʫʭōɖȤƴ˪ċʳĚƻĞʸɧȡɃȯ8ȁ3034ɅǮˆǩ6206ǬǰǱǳʼȿˠʐɌʓɏʗ"˾ʯ˸Ũǻ˼ŎʇǎĽʹɶǰ8ǹ̑0ǲˊɅȸ̍ʺȿǭ̏Ƀ1Ʌ6Ǻǫ̙ɊʑɍʔʖĀ̧ǏTim˶ǿȾ0ˍʰ˹ʁ̥"sȖǍèɨɶȄȃɮȆʡǬ5ɕʁˇȵȉǶǲʻǹȹǸ̀˖ōĀĭźe˥Ą{Ȥƙbuff͙Inʇ͛ċ˚opătrĹċǍǏǑǓǕǗɐvˤ˯ƷŜɤʖąǙʪeʬʮ̞ΔʔƐƭΙĦ]ƲČtɨ͸ċsourcͶΛƎ͹ζθέκηλιμοξρνσπτςοΨͯʆʈƯ΅·̀ˢ̝̓Ā΍ǐǒk͉͋Ζ˴ΠƑϕΏǔǖō1͑Ũƅɛȩǣȫ́ɩɬȶͣȅ4ˍǷȃɚˇȁ̻ɿȇȌȊȌȦ˔ϑ̜ͶȞϪĉɕϥń8˻ɜɞɠɢɤɦ͛Ǫ̽ͣɺˍˏɻϵͥǩ˫3̉ȯǷˉ̭̊ņ˔Ͱ˘ʋʮϐ͂ЂͅƣĶʚƧƵΝΟ˶ЈʝЋϩȠ̪.ȸȿȹʣɪ˒7Ƿ̵ɶЙɽϹȅϻȉЫ̛ˤЮ˱ɶ͏ͣɕіїіϤĢ

`.split('\n').join(''))