






import { G } from './nunigraph/init.js';
import { GraphController } from './nunigraph/init.js'
import './nunigraph/presets.js'
import './scales/presets.js'
import './buffer_utils/buffer_utils.js'
import './main/resize.js'


console.log('o-O-__-O-o-_.._-o-O-__-O-oo-O-__-O-o-_.._-o-O-__-O-oo-O-__-O-o-_.._-o-O-__-O-oo-O-__-O-o-_.._-o-O-__-O-o')
console.log('Testing 1 2 3 5/19/2020') 
console.log('here comes the import test')
console.log(G)


const graph0 = `

{"connectiăs":Ā1Č[ĀidČ0,āăąćĉnTypeČāhaĄel"}]ė2ĐĒĔ:ĖĘĦěăĞĠĢcĤĦĨĪ}ėnodeċ:đ"ēĕėtğġ:"gain"ŋitlŎŐŒŔėxĕ.5623529411764706ėyŠť12Ů600Ŭ77543ėaudĉParamValuńČĀőœŠ48ŰŭŰ25źƝ04}ĿįČ1ŋōĢoscillatorŕ"ĈŘŚƩƫƭƯƱƳşı.68373879ŭ1ƖŦ8ŲŠ6103ŭǁ33013ƀ5ƂƄĉNłŎĀMONOČ6ǩ42Ĳćƾ{Ŀ"kbMǡĢpolųėĂĴteƐņǰī"sourcȁĀƖƑňsOŔ:fƍseǱ49ȎiȐȒȔlȖǱƜțȝČȟȡė5ďčȏȑȦȕȗȩĭčȢ3ȤȮȓȰȢ4ȷȞȺȩ5ƑȢ6ɂȩ7Ʌ"6ɁȴėǩɈ6ɇɌɉ8ɏȚɒůɈ7ȫǰė7ȳɜ"ǄəȼɗɋɠŬəɑɧɔɗɖɠƗɈ8ɛǱ8ɟɴȶɒ8ɤɯɦɴɄɹɪɴɬɯɮǱ90Ɉ18ɿɠʊʁėʊʃǱʊʅʐʇʉ9ɳĬ1ʕ"22ʚʞʟɂǱADSRŅȌʃ"rħeaȖIİ-1ȘɮʭʯʱeʳČʵȢʈȬʮřʻʽ:ʿȩɛʹ˄ʲʴʶȲȎ˃ʰˍʾˏ"5ɸĀ˒˅ˎȻˑʺ˔ˇ˖5ɦˋ˓ʼ˝ȩʌ˦˜˕Ȣɪˬˡˈɉ˥˛˲˖Ɏ˂ˠ˨ˮɍ˰˶˼ˢǱǁ˟ˌ́˳6ʸ̀ˆ˳ɘ˺̆̌˖ɚ̅˧̑Ǳɞ̔˭̂ɝ˙˱̇̒ɻ̞̖ɝ˵˻̣ɡ˫̋˩ɡ˿̦̫7ʬ̪˽ɡ̮̳̊ɰ̫̏̕ɲ̙˷ɴɟ̢̛̻̝̲"ɺ̟̽ɴ̶̥̻̩̐ͅǆ̧͈8̱͏˳8̵̳͌ʗ̹̚˳ʊ͎͚ͅʎ̫͒ʑ̳ͥʔͨͣ͜˚͖˖ʜˊ̈́˳ʠ͙̺̳ʟͲͯǱʟ̀ͳʶǱƮstǵŁKeyPʮsȖˎė_ŌĸŏtriĥgřƳŃtuąȎsȉʤėfʮqƏncųȬΠcʤǱƃƅoǠŃķŚΔΖnΘġǝαƇƉƋƍƏʪ"ΤeΦeΨΪŪĲΛΝŎ1ǀƖƀžơ,ƣ:2ƦΒ"buffeƲŖƶĢϝϟϡƽƕ3ʙƗ˘Žɞ0ǆƟǎƿǐƗǫʟŭǆŦϫμǟǶȬǤǦǨǪǬǼtǯǱǳǵŃǷǹǻĳĚǿȁđĪėȆȈȊσȍɒșɈȣɒȪПɶȩ˙˞Сɽ˪Пʏ˴ɏʌ̃Ь̄ɒ̉əˁɧʡ̘ɗЦɝɻ̗Щ̨ɩəʒɝʝ̸ɯʡɵɱл͆нė8пʋɱЬ͔ɱʝͭʓёɒͤњєќʝʜжʓʙɈ͵ѤʠѦɶʥʧʩȎМͮ͢˳О̾͝ȩж̳́Тѳ͉ːѺ̧˘ͫ˳ſҀˣ͋ͷͅŢ҃˯҉ɍ҅͞˸̭҆̈͡Ѱ˸͕Ҕ̃ͶҎ̗ѶͿ̗ͺҗɝ;ͻ̜ҋɡ̡ҝ̤ҥɨѽ̯ғґ̒Җү̗ҙѴ͆Ҝң͆ҟҲюҢҠ͆̓Ҹ͇Ҭ̷ҍҵљѯһ͆ҮҚюұӌ͆Ҵѻ"ͭѷͣӇӕ͑͟ӃӖӎҵͪӛ͟ӔҨ"ͱҥѥӠ˖͹ӦʣӨϕ"΂΄ăo·Ή΋΍˕ėloopČΔƏėϦϠrInŃƾόeΜΞΫΡȴǱpƮybackRƯǢȅԎǰӮΰƆƈƊƌƎȋ"ԑaԓԕԗԙŠŤŢťėύԌ0ơ]}

`.split('\n').join('')


G.fromString(graph0)

GraphController.renderer.render()